app/Modules/Landing/Models/AuthModel.php

    function cekUser($usr_email)
    {
        $builder = $this->db->table('x_user');
        $builder->select('x_user.*, x_userrole.*, x_usergroup.*');
        $builder->join('x_userrole', 'x_userrole.usr_id=x_user.usr_id');;
        $builder->join('x_usergroup', 'x_userrole.usg_id=x_usergroup.usg_id');
        $builder->where('x_user.usr_email', $usr_email);
        $query = $builder->get();
---
SELECT `x_user`.*, `x_userrole`.*, `x_usergroup`.*
FROM `x_user`
JOIN `x_userrole` ON `x_userrole`.`usr_id`=`x_user`.`usr_id`
JOIN `x_usergroup` ON `x_userrole`.`usg_id`=`x_usergroup`.`usg_id`
WHERE `x_user`.`usr_email` = 'zidannurhakim@guest.uin-malang.ac.id'