app/Modules/Manajemen/Models/HakaksesModel.php

    function data($limit, $start, $orderColumn, $orderDirection, $search = null)
    {
        $builder = $this->db->table('x_userrole usrl');
        $builder->select('usr.usr_id, usr.usr_full, usr.usr_email, usg.usg_name, usrl.update');
        $builder->join('x_user usr', 'usrl.usr_id = usr.usr_id');
        $builder->join('x_usergroup usg', 'usrl.usg_id = usg.usg_id');

        // Pencarian (search)
        if ($search) {
            $builder->groupStart()
                ->like('usr.usr_full', $search)
                ->orLike('usr.usr_email', $search)
                ->orLike('usg.usg_name', $search)
                ->orLike('usrl.update', $search)
                ->groupEnd();
        }

        // Pengurutan (order)
        $builder->orderBy($orderColumn, $orderDirection);

        // Limit dan Offset (pagination)
        $builder->limit($limit, $start);

        return $builder->get()->getResult();
---
SELECT `usr`.`usr_id`, `usr`.`usr_full`, `usr`.`usr_email`, `usg`.`usg_name`, `usrl`.`update`
FROM `x_userrole` `usrl`
JOIN `x_user` `usr` ON `usrl`.`usr_id` = `usr`.`usr_id`
JOIN `x_usergroup` `usg` ON `usrl`.`usg_id` = `usg`.`usg_id`
ORDER BY `usr_id` ASC
 LIMIT 10