app/Modules/Modules/Models/AdminModel.php

    function countAll($lay_id = null)
    {
        $builder = $this->db->table('layanan_data AS a');
        $builder->select('a.*, b.lay_nama');
        $builder->join('layanan_jenis AS b', 'a.lay_id = b.lay_id', 'left');
        $builder->orderBy('a.data_update', 'DESC');
        if (!empty($lay_id)) {
            $builder->where('a.lay_id', $lay_id);
        }
        return $builder->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `layanan_data` AS `a`
LEFT JOIN `layanan_jenis` AS `b` ON `a`.`lay_id` = `b`.`lay_id`
WHERE `a`.`lay_id` = '1ee4c28e-25ca-441b-9eb2-1288def3ec4b'