app/Modules/Modules/Models/PesanMasukModel.php

SELECT COUNT(*) AS `numrows`
FROM `layanan_data_log` AS `a`
LEFT JOIN `layanan_data` AS `b` ON `a`.`data_id` = `b`.`data_id`
LEFT JOIN `layanan_jenis` AS `c` ON `b`.`lay_id` = `c`.`lay_id`
LEFT JOIN `x_user` AS `u` ON `a`.`log_usr_id_pengirim` = `u`.`usr_id`
WHERE `b`.`data_status_kirim` = 'KIRIM'
AND `b`.`data_status_selesai` = 'BELUM'
---
    function countAll()
    {
        $builder = $this->db->table('layanan_data_log AS a');
        $builder->select('
            b.data_id,
            c.lay_nama,
            b.data_metode,
            b.data_nama,
            b.data_nip,
            b.data_peran,
            b.data_email,
            b.data_nomorhp,
            b.data_subjek,
            a.log_status_baca,
            u.usr_full AS log_usr_full_pengirim,
            u.usr_nip AS log_usr_nip_pengirim,
            u.usr_email AS log_usr_email_pengirim,
            u.usr_nomorhp AS log_usr_nomorhp_pengirim,
            a.log_pesan,
            b.data_status_kirim_update,
            b.data_update
        ');
        $builder->join('layanan_data AS b', 'a.data_id = b.data_id', 'left');
        $builder->join('layanan_jenis AS c', 'b.lay_id = c.lay_id', 'left');
        $builder->join('x_user AS u', 'a.log_usr_id_pengirim = u.usr_id', 'left');
        $builder->where('b.data_status_kirim', "KIRIM");
        $builder->where('b.data_status_selesai', "BELUM");
        $builder->orderBy('b.data_update', 'DESC');
        return $builder->countAllResults();