app/Modules/Layanan/Models/JenisModel.php

    function countAll()
    {
        $builder = $this->db->table('layanan_jenis AS a');
        return $builder->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `layanan_jenis` AS `a`

    function tambah($data)
    {
        $db = \Config\Database::connect();
        $builder = $db->table('layanan_jenis');
        return $builder->insert($data);
---
INSERT INTO `layanan_jenis` (`lay_id`, `lay_nama`, `lay_urutan`, `lay_status`, `lay_update`) VALUES ('11e55335-7af8-4b40-8f94-662239d2ba1d', 'Lain-lain', '92', '1', '2025-07-26 12:12:48')

    function hapus($id)
    {
        $db = \Config\Database::connect();
        $builder = $db->table('layanan_jenis');
        $builder->where('lay_id', $id);
        return $builder->delete();
---
DELETE FROM `layanan_jenis`
WHERE `lay_id` = '755a0d08-0e3b-4a4c-91da-81e49f3c99c0'