app/Modules/Layanan/Models/UnitModel.php

    function countAll()
    {
        $builder = $this->db->table('layanan_unit AS a');
        $builder->select(
            'a.*,
            lay1.unit_nama AS nama1,
            lay2.unit_nama AS nama2,
            lay3.unit_nama AS nama3,
            lay4.unit_nama AS nama4,
            lay5.unit_nama AS nama5,'
        );
        $builder->join('layanan_unit AS lay1', 'lay1.unit_id = a.unit_unitid AND a.unit_unitid != "KOSONG"', 'left');
        $builder->join('layanan_unit AS lay2', 'lay2.unit_id = lay1.unit_unitid AND lay1.unit_unitid != "KOSONG"', 'left');
        $builder->join('layanan_unit AS lay3', 'lay3.unit_id = lay2.unit_unitid AND lay2.unit_unitid != "KOSONG"', 'left');
        $builder->join('layanan_unit AS lay4', 'lay4.unit_id = lay3.unit_unitid AND lay3.unit_unitid != "KOSONG"', 'left');
        $builder->join('layanan_unit AS lay5', 'lay5.unit_id = lay4.unit_unitid AND lay4.unit_unitid != "KOSONG"', 'left');
        $builder->orderBy('a.unit_nama', 'ASC');
        return $builder->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `layanan_unit` AS `a`
LEFT JOIN `layanan_unit` AS `lay1` ON `lay1`.`unit_id` = `a`.`unit_unitid` AND `a`.`unit_unitid` != "KOSONG"
LEFT JOIN `layanan_unit` AS `lay2` ON `lay2`.`unit_id` = `lay1`.`unit_unitid` AND `lay1`.`unit_unitid` != "KOSONG"
LEFT JOIN `layanan_unit` AS `lay3` ON `lay3`.`unit_id` = `lay2`.`unit_unitid` AND `lay2`.`unit_unitid` != "KOSONG"
LEFT JOIN `layanan_unit` AS `lay4` ON `lay4`.`unit_id` = `lay3`.`unit_unitid` AND `lay3`.`unit_unitid` != "KOSONG"
LEFT JOIN `layanan_unit` AS `lay5` ON `lay5`.`unit_id` = `lay4`.`unit_unitid` AND `lay4`.`unit_unitid` != "KOSONG"